#### AnalysisDisplayStyleMarkerType Enumeration

---

|  |
| --- |
| See Also |

Marker types for Markers and Text settings of analysis display style.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public enum AnalysisDisplayStyleMarkerType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AnalysisDisplayStyleMarkerType ``` |

| Visual C++ |
| --- |
| ``` public enum class AnalysisDisplayStyleMarkerType ``` |

# Members

| Member name | Description |
| --- | --- |
| Circle |  |
| Square |  |
| Triangle |  |

# See Also

Autodesk.Revit.DB.Analysis Namespace